Absolutely, same results are reproduced on **v0.12.29**, **v0.13.4** and **v0.14.7** using latest plugin **3.58.0**.

```
$ nl disk.tf
     1  resource "google_compute_disk" "disk01" {
     2      name = "disk01"
     3      size = 10
     4  }

$ terraform init

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "google" (hashicorp/google) 3.58.0...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.google: version = "~> 3.58"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

$ terraform version
Terraform v0.12.29
Terraform v0.13.4 <- same result
Terraform v0.14.7 <- same result
+ provider.google v3.58.0

Your version of Terraform is out of date! The latest version
is 0.14.7. You can update by downloading from https://www.terraform.io/downloads.html


$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_disk.disk01 will be created
  + resource "google_compute_disk" "disk01" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + name                      = "disk01"
      + physical_block_size_bytes = (known after apply)
      + project                   = (known after apply)
      + self_link                 = (known after apply)
      + size                      = 10
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-standard"
      + users                     = (known after apply)
      + zone                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_compute_disk.disk01: Creating...
google_compute_disk.disk01: Creation complete after 7s [id=projects/some-project-1234/zones/us-central1-a/disks/disk01]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Disk is scaled to 5 from 10:
```
$ nl disk.tf
     1  resource "google_compute_disk" "disk01" {
     2      name = "disk01"
     3      size = 5
     4  }

$ terraform apply
google_compute_disk.disk01: Refreshing state... [id=projects/some-project-1234/zones/us-central1-a/disks/disk01]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_disk.disk01 must be replaced
-/+ resource "google_compute_disk" "disk01" {
      ~ creation_timestamp        = "2021-03-03T22:58:34.534-08:00" -> (known after apply)
      ~ id                        = "projects/some-project-1234/zones/us-central1-a/disks/disk01" -> (known after apply)
      ~ label_fingerprint         = "42WmSpB8rSM=" -> (known after apply)
      - labels                    = {} -> null
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
        name                      = "disk01"
      ~ physical_block_size_bytes = 4096 -> (known after apply)
      ~ project                   = "some-project-1234" -> (known after apply)
      ~ self_link                 = "https://www.googleapis.com/compute/v1/projects/some-project-1234/zones/us-central1-a/disks/disk01" -> (known after apply)
      ~ size                      = 10 -> 5 # forces replacement
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
        type                      = "pd-standard"
      ~ users                     = [] -> (known after apply)
      ~ zone                      = "us-central1-a" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_compute_disk.disk01: Destroying... [id=projects/some-project-1234/zones/us-central1-a/disks/disk01]
google_compute_disk.disk01: Destruction complete after 6s
google_compute_disk.disk01: Creating...
google_compute_disk.disk01: Creation complete after 5s [id=projects/some-project-1234/zones/us-central1-a/disks/disk01]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.
```

Same attempt with gcloud yields expected error:
```
$ gcloud compute disks describe disk01 --format="csv(sizeGb)"
size_gb
5

$ gcloud compute disks resize disk01 --size=4

This command increases disk size. This change is not reversible.
For more information, see:
https://cloud.google.com/sdk/gcloud/reference/compute/disks/resize

Do you want to continue (Y/n)?  y

ERROR: (gcloud.compute.disks.resize) Could not fetch resource:
 - Invalid value for field 'sizeGb': '4'. New disk size '4' GiB must be larger than existing size '5' GiB.

```